# PROBLEM 14:
# Создать 5 переменных:
# a.Чётное число
# b.Любое от 5 до 15
# c.Дробное число до 20
# d.Любое нечётное число
# e.Любое число

a = 2
b = 10
c = 10.5
d = 5
e = 8

print(a, b, c, d, e)

