# PROBLEM 10:
# Найдите средне арифмитическое чисел:25, 75, 10, 95.

avg = (25 + 75 + 10 + 95) / 4
print(avg)

#answer 51.25
