# PROBLEM 9:
# Создать 2 переменные.
# В первой год вашего рождения,
# Во второй 2022 год
# посчитайте сколько лет вам должно быть через 2 года
# и сколько лет вам было два года назад

b = 1986
n = 2022
f = (n - b) + 2
p = (n - b) - 2
print(f)
print(p)
