# PROBLEM 17:
# Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой.
# Первые 2 переменные между собой сложить и умножить на 3 переменную.

a = 10.0
b = 10.0
c = 10.0
d = (a + b) * 3
print(d)

#answer 60.0