# 4. Создайте словарь в котором вы будете хранить все типы данных,
# которые вы знаете, по примеру: {'int': 69, 'str': 'Hello world' ...}.
# Затем загуглите количество типов данных в python и сравните с длинной вашего словаря.

a = {'int': 69, 'str': 'Hello world'}
print(a)