# 2. Дана строка 'abcdefghijklmnopqrstuvwxyz'. Вывести порядковый номер, главную и
# заглавную букву алфавита.

str1 = 'abcdefghijklmnopqrstuvwxyz'

for i in range(len(str1)):


    print(str1[i], 'is under index', i)